Autodesk.Revit.DB.Structure.AnalyticalElementSelector
Specifies a portion of an Analytical Element or the whole element.

Autodesk.Revit.DB.Structure.AnalyticalElementSelector.Whole
Entire element

Autodesk.Revit.DB.Structure.AnalyticalElementSelector.EndOrTop
End or top of element (corresponds to end = 1).

Autodesk.Revit.DB.Structure.AnalyticalElementSelector.StartOrBase
Start or base of element (corresponds to end = 0).